# pandas 자료 구조
- pandas는 DataFrame과 Series의 2가지 데이터 형태를 가짐
    - DataFrame : 2차원 형태(테이블(행, 열)) -> 1개 이상의 Series가 합쳐진 형태
    - Series    : 1차원 형태
- dtype
    - 컬럼의 포괄적인 data type 
    - DataFrame.dtypes, Series.dtype
    ---
  dtype | python
  - | -
  int(64...8) | int
  float(64...8) | float
  bool | bool
  object(복합적인 타입) | str
  datetime(64...8) | datetime
  category(DBMS의 도메인) | x
     ---

In [37]:
import pandas as pd

lt = [range(1,7,2), range(2,7,2), range(10,31,10)]
df = pd.DataFrame(data=lt, columns=[f'co{idx}' for idx in range(1,4)])
df

   co1  co2  co3
0    1    3    5
1    2    4    6
2   10   20   30

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   co1     3 non-null      int64
 1   co2     3 non-null      int64
 2   co3     3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [40]:
# df.loc[3] = [50, 50, '오십']
df.loc[df.shape[0]] = [50, 50, '오십']
df

   co1   co2 co3
0    1   3.0   5
1    2   4.0   6
2   10  20.5  30
3   50  50.0  오십

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   co1     4 non-null      int64
 1   co2     4 non-null      int64
 2   co3     4 non-null      object
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [12]:
# 행과 열 
df.shape

# 행의 개수
# len(df)
df.shape[0]

# 열의 개수
df.shape[1]

(6, 3)

In [29]:
df.co3[3]

'오십'

In [33]:
type(df.co3.dtype)

numpy.dtype[object_]

In [42]:
# co2의 20을 20.5로 변경
df.loc[df.co2 == 20, 'co2'] = 20.5
# 컬럼에 실수가 들어오면 모든 int가 float으로 변환
# float은 파이썬의 float이 아닌 numpy의 float으로 변환
# numpy의 타입이 파이썬의 타입보다 세분화돼 numpy 사용
df

   co1   co2 co3
0    1   3.0   5
1    2   4.0   6
2   10  20.5  30
3   50  50.0  오십

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   co1     4 non-null      int64
 1   co2     4 non-null      float64
 2   co3     4 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [45]:
type(df.co2[0])

numpy.float64

In [46]:
# co1에 2를 결측치로 변경
# 결측치(NaN)는 numpy라이브러리 있음
import numpy as np

In [48]:
df.loc[df.co1 == 2,'co1'] = np.NAN
df

    co1   co2 co3
0   1.0   3.0   5
1   NaN   4.0   6
2  10.0  20.5  30
3  50.0  50.0  오십